# Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
#       Примеры:
#           список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
#           список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
#           список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
#           список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
#           список: [], ищем: "123", ответ: -1
def finder(_list, ss):
    if _list.count(ss) > 1:
        idx = _list.index(ss)
        return f"'{ss}' was found in {_list} with index {_list.index(ss, idx + len(ss))}"
    else:
        return f"'{ss}' was not found in {_list}"


if __name__ == '__main__':
    print(finder(["qwe", "asd", "zxc", "qwe", "ertqwe"], "qwe"))
    print(finder(["123", "234", 123, "567"], "123"))
    print(finder(["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], "йцу"))
